extended_latin = """
Ä|A#:

Ü|U#:

ß|$# 

ä|a#: 

ö|o#: 

ü|u#: 

Ö|o#: 

À|A#%

¡|!/ 

¢|c#* 

£|p#* 

¤|z#* 

¥|y#* 

¦||#* 

§|$#* 

¨|#: 

©|r#* 

¬|n#* 

®|R#* 

¯|#_ 

°|d#* 

±|+#- 

²|2#* 

³|3#* 

´|#/ 

µ|m#* 

¶|P#*

·|O#* 

¸|#? 

¹|1#*

º|0#* 

¿|q#*

À|A#%

Á|A#/

Â|A#^  

Å|A#.  

Æ|A#= 

Ç|C#?  

È|E#%  

É|E#/ 

Ê|E#^ 

Ë|E#:

Ì|I#% 

Í|I#/ 

Î|I#^

Ï|I#:

Ð|D#+

Ñ|N#~ 

Ò|O#% 

Ó|O#/ 

Ô|O#^ 

Õ|O#~ 

Ö|O#: 

×|x#*

Ø|O#+

Ù|U#% 

Ú|U#/ 

Û|U#^ 

Ü|U#: 

Ý|Y#/ 

Þ|t#*

à|a#% 

á|a#/

â|a#^ 

ã|a#~

å|a#@

æ|a#=

ç|c#?  

è|e#%  

é|e#/

ê|e#^  

ë|e#: 

ì|i#% 

í|i#/ 

ï|i#:

ð|o#~ 

ñ|n#~ 

ò|o#% 

ó|o#/ 

ô|o#^

õ|o#~

ø|o#+ 

ù|u#% 

ú|u#/

û|u#^

ý|y#/ 

þ|p#=

ÿ|y#: 

Ā|A#_ 

ā|a#_ 

Ă|A#> 

ă|a#> 

Ą|A#?

ą|a#?

Ć|C#/

ć|c#/ 

Ĉ|C#^ 

ĉ|c#^ 

Ċ|C#. 

ċ|c#. 

Č|C#< 

č|c#< 

Ď|D#< 

ď|d#< 

Đ|D#+ 

đ|d#+ 

Ē|E#_ 

ē|e#_ 

Ĕ|E#>

ĕ|e#>

Ė|E#.

ė|e#.

Ę|E#? 

ę|e#?

Ě|E#<

ě|e#< 

Ĝ|G#^ 

ĝ|g#^ 

Ğ|G#>

ğ|g#>

Ġ|G#. 

ġ|g#. 

Ģ|G#?

ģ|g#?

Ĥ|H#^ 

ĥ|h#^ 

Ħ|H#+ 

ħ|h#+

Ĩ|I#~

ĩ|i#~

Ī|I#_ 

ī|i#_ 

Ĭ|I#> 

ĭ|i#> 

Į|I#?

į|i#?

İ|I#. 

Ĳ|I#=

ĳ|i#j 

Ĵ|J#^ 

ĵ|j#^

Ķ|K#? 

ķ|k#? 

ĸ|k#* 

Ĺ|L#/ 

ĺ|l#/ 

Ļ|L#? 

ļ|l#? 

Ľ|L#< 

ľ|l#< 

Ŀ|L#.

ŀ|l#. 

Ł|L#+ 

ł|l#+ 

Ń|N#/ 

ń|n#/ 

Ņ|N#? 

ņ|n#? 

Ň|N#< 

ň|n#< 

ŉ|n#.  

Ō|O#_ 

ō|o#_ 

Ŏ|O#> 

ŏ|o#> 

Ő|O#" 

ő|o#" 

Œ|O#* 

œ|o#* 

Ŕ|R#/ 

ŕ|r#/ 

Ŗ|R#? 

ŗ|r#? 

Ř|R#< 

ř|r#< 

Ś|S#/ 

ś|s#/

Ŝ|S#^ 

ŝ|s#^ 

Ş|S#? 

ş|s#? 

Š|S#< 

š|s#< 

Ţ|T#? 

ţ|t#? 

Ť|T#< 

ť|t#< 

Ŧ|T#+ 

ŧ|t#+ 

Ũ|U#~ 

ũ|u#~ 

Ū|U#_ 

ū|u#_ 

Ŭ|U#> 

ŭ|u#> 

Ů|U#@

ů|u#@

Ű|U#"

ű|u#" 

Ų|U#?

ų|u#?

Ŵ|W#^

ŵ|w#^ 

Ŷ|Y#^ 

ŷ|y#^ 

Ÿ|Y#: 

Ź|Z#/ 

ź|z#/ 

Ż|Z#. 

ż|z#. 

Ž|Z#< 

ž|z#< 

Ȁ|A#;

ȁ|a#;

Ȃ|A#)

ȃ|a#)

Ȅ|E#;

ȅ|e#; 

Ȇ|E#)

ȇ|e#)

Ȉ|I#; 

ȉ|i#;

Ȋ|I#)

ȋ|i#)	

Ȍ|O#;

ȍ|od#;	

Ȏ|O#)

ȏ|o#)

Ȑ|R#;

ȑ|r#;

Ȓ|R#) 

ȓ|r#) 

Ȕ|U#;

ȕ|u#;

Ȗ|U#)

ȗ|u#)

ȴ|l#(

ȵ|n#(

ȶ|t#(

Ș|S#, 

ș|s#, 

Ț|T#, 

ț|t#, 

Ǎ|A#< 

ǎ|a#< 

Ǐ|I#< 

ǐ|i#< 

Ǒ|O#< 

ǒ|o#< 

Ǔ|U#< 

ǔ|u#< 

Ǖ|U#_ 

ǖ|u#:_

Ǘ|U#:_

ǘ|u#:_ 

Ǚ|U#:_

ǚ|u#:_

Ǜ|U#:_

ǜ|u#:_

ǝ|e#=

Ǟ|A#:

ǟ|a#:	

Ǡ|A#. 	

ǡ|a#. 	

Ǣ|Æ#_ 	

ǣ|ae#_ 	

Ǥ|G#+ 

ǥ|g#+ 	

Ǧ|G#< 

ǧ|g#< 

Ǩ|K#< 

ǩ|k#< 

"""
